{"basics":{"name":"Athar Mahmoudi","label":"","image":"","email":"athar1@ualberta.ca","phone":"(587) 501-8919","url":"","summary":"","location":{"address":"10135 Saskatchewan Dr","postalCode":"","city":"Edmonton","countryCode":"Canada","region":""},"profiles":[{"network":"","username":"","url":""}]},"interests":[{"name":"Reinforcement Learning","icon":"fa-solid fa-brain","keywords":["Reinforcement Learning","RL from Human Feedback (RLHF)","Deep Reinforcement Learning","Model-Free RL","Transfer Learning in RL"]},{"name":"Human-Centered AI","icon":"fa-solid fa-users","keywords":["Human-Computer Interaction (HCI)","Personalized Therapy","Adaptive Systems"]}],"work":[{"name":"Samsung Research Montreal","location":"Montreal, Canada","position":"Intern Research Scientist","url":"https://research.samsung.com/aicenter_montreal","startDate":"2022-06-01","endDate":"2023-05-01","summary":"","highlights":["Implemented and evaluated reinforcement learning architectures to optimize agent performance.","Developed curriculum learning techniques to effectively train RL agents.","Implemented a Vector Quantized Variational Autoencoder for efficient high-dimensional data clustering.","Adapted and integrated an existing Online Decision Transformer within our RL framework."]},{"name":"Pars Cognition","location":"Tehran, Iran","position":"Research Engineer","url":"https://www.maghzineh.com/","startDate":"2017-09-01","endDate":"2018-09-01","summary":"","highlights":["Developed mini-serious video games within the field of cognitive science."]}],"education":[{"institution":"University of Alberta","location":"Edmonton, Canada","url":"https://www.uzh.ch/","area":"Computing Science","studyType":"Doctor of Philosophy","startDate":"2018-09-01","endDate":"2024-12-01","score":"","courses":["Intro to Virtual/Augmented Reality and Telepresence","Machine Learning and the Brain","Image Processing and Analysis in Diagnostic Imaging"]},{"institution":"Shahid Beheshti University,","location":"Tehran, Iran","url":"https://www.ualberta.ca/en/computing-science/","area":"Computer Engineering/Artificial Intelligence","studyType":"Master of Science,","startDate":"2014-09-01","endDate":"2017-08-01","score":"","courses":["Machine Learning","Neural Network","Pattern Recognition","Data Mining","Image Processing","Natural Language Processing"]},{"institution":"University of Tehran,","location":"Tehran, Iran","url":"https://encse.sbu.ac.ir/","area":"Computer Engineering/Software Engineering","studyType":"Bachelor of Science","startDate":"2009-09-01","endDate":"2014-08-01","score":"","courses":["Advanced Programming","Database Design","Data Structures","Artificial Intelligence","Operating Systems","Human-Computer Interaction","Intro to Multimedia","Intro to eLearning"]}],"skills":[{"name":"Programming Languages","level":"Master","icon":"fa-solid fa-code","keywords":["Python","MATLAB","C#","Java","SQL"]},{"name":"Development Tools","level":"Master","icon":"fa-solid fa-tools","keywords":["VS Code","MS Visual Studio","Git","Jupyter Notebook","Google Colab"]},{"name":"Frameworks and Libraries","level":"Master","icon":"fa-solid fa-cubes","keywords":["PyTorch","OpenAI Gym","Microsoft .NET","Unity"]}],"publications":[{"name":"The differences between children with autism and typically developed children in using a hand-eye-coordination video game","publisher":"Ubiquitous Computing and Ambient Intelligence: 11th International Conference, UCAmI","releaseDate":"2017","url":"https://link.springer.com/chapter/10.1007/978-3-319-67585-5_27","summary":"This paper introduces a touch-based hand-eye coordination video game that effectively differentiates between children with autism and typically developing children using only two in-game features, demonstrating its potential as a cost-free tool for initial screening of motor coordination issues in autism."},{"name":"A framework for easier designs: Augmented intelligence in serious games for cognitive development","publisher":"IEEE Consumer Electronics Magazine","releaseDate":"2018","url":"https://ieeexplore.ieee.org/abstract/document/8570903","summary":"This article introduces a portable, rapid development framework for intelligent serious games that leverage human intervention to minimize complex AI requirements, enabling caregivers to foster social interactions with children with special needs across various settings."},{"name":"Automated personalized exposure therapy based on physiological measures using experience-driven procedural content generation","publisher":"Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment","releaseDate":"2021","url":"https://ojs.aaai.org/index.php/AIIDE/article/view/18914","summary":"This research proposes a personalized virtual reality exposure therapy framework that utilizes physiological sensors and machine learning algorithms to automatically adapt exposure parameters through procedural content generation, addressing the limitations of subjective, hand-authored methods, with planned human studies on arachnophobia and fear of public speaking."},{"name":"Arachnophobia exposure therapy using experience-driven procedural content generation via reinforcement learning (EDPCGRL)","publisher":"Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment","releaseDate":"2021","url":"https://ojs.aaai.org/index.php/AIIDE/article/view/18904","summary":"This paper proposes a reinforcement learning-based approach that uses physiological measures to automatically adapt therapeutic content in arachnophobia exposure therapy, generating personalized virtual spiders that adapt more quickly and accurately than existing search-based methods."},{"name":"Label-Free Subjective Player Experience Modelling via Let's Play Videos","publisher":"Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment","releaseDate":"2024","url":"https://arxiv.org/abs/2410.02967","summary":"This paper introduces a label-free approach to Player Experience Modelling (PEM) using gameplay videos, validated through strong correlations with affective measures in Angry Birds gameplay."},{"name":"Stress Detection from Photoplethysmography in a Virtual Reality Environment","publisher":"ArXiv","releaseDate":"2024","url":"https://arxiv.org/abs/2409.17427","summary":"This article presents a virtual reality exposure therapy platform that non-intrusively assesses patients' mental states using photoplethysmography (PPG) signals, achieving a 70.6% accuracy in classifying relaxing and stressful states—outperforming more complex methods."},{"name":"Spiders Based on Anxiety: How Reinforcement Learning Can Deliver Desired User Experience in Virtual Reality Personalized Arachnophobia Treatment","publisher":"Under review","releaseDate":"2024","url":"https://arxiv.org/abs/2409.17406","summary":"This paper introduces a framework for personalized virtual reality exposure therapy for arachnophobia that leverages procedural content generation and reinforcement learning to automatically adapt virtual spiders to elicit specific anxiety responses, demonstrating superior performance over traditional rules-based methods."}],"projects":[{"name":"Experience-Driven Procedural Content Generation via Reinforcement Learning","summary":"Developed an adaptive system using Experience-Driven Procedural Content Generation and Reinforcement Learning to tailor virtual environments based on user experiences.","highlights":["Implemented reinforcement learning algorithms in Python","Utilized OpenAI Gym for environment simulation and testing"],"url":"https://github.com/athar70/EDPCGRL4Spider"},{"name":"Online Decision Transformer","summary":"Developed an Online Decision Transformer using Python and PyTorch to enhance decision-making processes in dynamic environments.","highlights":["Implemented transformer models for real-time decision making","Leveraged PyTorch for efficient model training and deployment"],"url":""},{"name":"Vector Quantized Variational Autoencoder for Time-Series Clustering","summary":"Developed a Vector Quantized Variational Autoencoder using Python and PyTorch for effective clustering of time-series data.","highlights":["Implemented VQ-VAE architecture for dimensionality reduction","Applied to time-series data for improved clustering accuracy"],"url":""},{"name":"Curriculum Learning for Reinforcement Learning","summary":"Developed a curriculum learning approach for reinforcement learning using Python and OpenAI Gym to improve learning efficiency and performance.","highlights":["Implemented progressive learning strategies to enhance RL training","Utilized OpenAI Gym environments for robust testing and validation"],"url":""},{"name":"Stress Level Estimation Based on Physiological Responses","summary":"Estimated stress levels using physiological responses through traditional machine learning methods and LSTM models in Python, Scikit-learn, and PyTorch.","highlights":["Developed models to accurately classify stress states","Integrated physiological data for comprehensive analysis"],"url":"https://github.com/athar70/Stress-Estimation"},{"name":"Heart Rate Estimation from Video via CNN","summary":"Developed a Convolutional Neural Network in Python and PyTorch to estimate heart rate from video data, enabling non-intrusive physiological monitoring.","highlights":["Designed and trained CNN models for accurate heart rate estimation","Implemented video processing techniques"],"url":"https://github.com/athar70/Heart-Rate-Estimation"},{"name":"Behavior Pattern Analysis in Games","summary":"Applied machine learning techniques in MATLAB to identify distinct behavior patterns in game environments, enhancing user experience and engagement.","highlights":["Developed models to detect and categorize user behaviors","Utilized MATLAB for data analysis and visualization"],"url":""},{"name":"Adaptive Virtual Reality Environment","summary":"Created a Virtual Reality environment with dynamic parameters in Unity, allowing real-time adjustments based on user interactions and physiological responses.","highlights":["Implemented real-time parameter adjustments to enhance user experience","Integrated physiological sensors for adaptive environment changes"],"url":"https://www.youtube.com/watch?v=cYK5I_U6mK0&t=1s&ab_channel=AtharMahmoudi-Nejad"},{"name":"Serious Video Games Development","summary":"Developed small serious video games using GameMaker and Unity, focusing on educational and therapeutic applications to engage users effectively.","highlights":["Designed game mechanics to support educational and therapeutic goals","Utilized GameMaker and Unity for cross-platform game development"],"url":""},{"name":"Neural Network for Impulse Noise Detection","summary":"Implemented a neural network in MATLAB to detect impulse noise, improving signal processing accuracy in communication systems.","highlights":["Designed and trained neural network models for noise detection"],"url":""},{"name":"Hidden Semi-Markov Model for Mobility Tracking","summary":"Implemented a hidden semi-Markov model in Java to track mobility patterns with missing data and multiple observation sequences, enhancing data reliability and tracking accuracy.","highlights":["Developed robust models to handle incomplete and complex data","Improved mobility tracking through advanced statistical methods"],"url":""}],"volunteer":[{"organization":"CHI Conference 2024","position":"Reviewer","url":"https://chi2024.acm.org/","year":"2023","summary":"Served as a reviewer for CHI Conference 2024, providing peer reviews for submissions in human-computer interaction and related fields.","highlights":[]},{"organization":"Experimental AI in Games (EXAG)","position":"Committee Member","url":"https://www.exag.org/","year":"2024","summary":"Active committee member served as a reviewer for EXAG workshops focused on experimental AI in games.","highlights":[]},{"organization":"Computer Science Graduate Student Association (CSGSA)","location":"Edmonton, Canada","position":"Treasurer","url":"https://sites.google.com/ualberta.ca/csgsa","year":"2019","summary":"Managed the financial operations of the CSGSA, a voluntary group offering support and activities for Computing Science graduate students at the University of Alberta.","highlights":[]}],"awards":[{"title":"Olympiad Competition Award","date":"2008","awarder":"Math and Literature Olympiads for Pre-University Students","url":"","summary":"Awarded in the Math and Literature Olympiads for pre-university students."},{"title":"Ranked 459th in the Undergraduate Nationwide Universities Entrance Exam","date":"2009","awarder":"Nationwide Universities Entrance Exam, Iran","url":"","summary":"Achieved a ranking of 459th in the Undergraduate Nationwide Universities Entrance Exam in Iran, competing against over 300,000 participants."},{"title":"Ranked 65th in the Graduate Nationwide Universities Entrance Exam","date":"2014","awarder":"Graduate Nationwide Universities Entrance Exam, Iran","url":"","summary":"Achieved a ranking of 65th in the Graduate Nationwide Universities Entrance Exam in Iran, out of more than 30,000 participants."}],"references":[{"name":"Dr. Matthew Guzdial","icon":"fa-solid fa-thumbtack","reference":"Assistant Professor in Computing Science at the University of Alberta, specializing in creative artificial intelligence and machine learning.","url":"https://www.cs.ualberta.ca/~guzdial/"},{"name":"Professor Pierre Boulanger","icon":"fa-solid fa-thumbtack","reference":"Director of the Advanced Human-Computer Interfaces Laboratory at the University of Alberta, with over 40 years of expertise in 3D computer vision and virtual reality systems.","url":"https://webdocs.cs.ualberta.ca/~pierreb/"},{"name":"Dr. Di Wu","icon":"fa-solid fa-thumbtack","reference":"Senior Staff Research Scientist at Samsung AI Center Montreal and Adjunct Professor at McGill University, focusing on reinforcement learning and AI for telecommunications.","url":"https://sites.google.com/view/di-wu/home?authuser=0&pli=1"},{"name":"Dr. Hadi Moradi","icon":"fa-solid fa-thumbtack","reference":"Assistant Professor at the University of Tehran's Electrical and Computer Engineering School, specializing in climbing robots and intelligent systems.","url":"https://ece.ut.ac.ir/en/~moradih"}]}