{"basics":{"name":"Athar Mahmoudi","label":"Machine Learning Scientist","image":"","email":"athar1@ualberta.ca","phone":"(587) 501-8919","summary":"","location":{"address":"6080 McKay Ave","postalCode":"","city":"Burnaby","countryCode":"Canada","region":""},"profiles":[{"network":"","username":"","url":""}]},"interests":[{"name":"Reinforcement Learning","icon":"fa-solid fa-brain","keywords":["Model-Free RL","Deep Reinforcement Learning (DQN, PPO, SAC)","Q-Learning","Reward Modeling (RLHF-style)","Personalized Reward Models","Reward Shaping","Transfer Learning in RL"]},{"name":"Deep Learning & Time Series","icon":"fa-solid fa-chart-line","keywords":["Transformers","Decision Transformer","Long Short-Term Memory (LSTM)","Representation Learning (VAE, VQ-VAE)","Online Decision Transformer","Domain Adaptation","Domain Generalization"]},{"name":"Optimization & AutoML","icon":"fa-solid fa-cogs","keywords":["Bayesian Optimization","Hyperparameter Optimization (HBO)","AutoML pipelines"]},{"name":"Research Methods","icon":"fa-solid fa-microscope","keywords":["Explainable AI (SHAP)","Experimental Design (A/B Testing, Ablation Studies)","Statistical Analysis","Signal Processing","Uncertainty Estimation"]},{"name":"Video Games","icon":"fa-solid fa-gamepad","keywords":["Games as Psychological Measures","Games for Therapy","Game Adaptation"]}],"tools":[{"name":"Programming Languages","icon":"fa-solid fa-code","keywords":["Python","SQL","MATLAB","C#"]},{"name":"ML & DL Frameworks","icon":"fa-solid fa-cubes","keywords":["PyTorch","TensorFlow","Hugging Face","Stable Baselines3","Scikit-learn","OpenAI Gym"]},{"name":"DevOps & Cloud","icon":"fa-solid fa-cloud","keywords":["Docker","AWS","GCP","Git","Linux/Bash"]}],"work":[{"name":"Advanced Sensor Research Inc. (ASR)","location":"Edmonton, Canada","position":"Machine Learning Scientist","url":"https://advancedsensorresearch.ca/","startDate":"2025-01-16","summary":"Building end-to-end time-series machine learning pipelines for non-invasive glucose estimation.","highlights":["Built end-to-end time-series machine learning pipelines for non-invasive glucose estimation. [PyTorch, TensorFlow, Hugging Face]","Developed and benchmarked Transformer-based sequence models alongside baselines (LSTM, TCN), including representation learning with autoencoder-style pretraining. [PyTorch]","Ran structured architecture and hyperparameter experiments; compared training protocols for stability across sensor noise and session variability. [PyTorch, Scikit-learn]","Designed evaluation splits to test generalization across subjects/sessions/sensor units; investigated domain generalization and domain adaptation strategies. [PyTorch, Pandas]","Implemented explainability and error analysis workflows (slice-based analysis, failure mode analysis, calibration/uncertainty checks). [PyTorch]","Performed exploratory data analysis and signal-quality investigations to identify data issues and guide data-cleaning and collection improvements. [SciPy]"]},{"name":"Samsung Research Montreal","location":"Montreal, Canada","position":"Intern Research Scientist","url":"https://research.samsung.com/aicenter_montreal","startDate":"2022-06-01","endDate":"2023-04-01","summary":"Designed and evaluated deep reinforcement learning methods for network load balancing and energy efficiency.","highlights":["Designed and evaluated deep reinforcement learning methods for network load balancing in simulated environments. [PyTorch, OpenAI Gym, Stable Baselines3]","Implemented curriculum learning to improve training robustness and generalization to harder scenarios. [PyTorch, Stable Baselines3]","Implemented a Vector-Quantized Variational Autoencoder (VQ-VAE) for representation learning within RL pipelines. [PyTorch]","Adapted and integrated an Online Decision Transformer into an existing RL framework to enhance network load balancing and energy efficiency. [PyTorch, Hugging Face]"]},{"name":"Pars Cognition","location":"Tehran, Iran","position":"Software Engineer","url":"https://www.maghzineh.com/","startDate":"2017-09-01","endDate":"2018-09-01","summary":"Created engaging video game experiences aimed at cognitive assessment and development.","highlights":["Developed mini-serious video games targeting cognitive science applications and research."]}],"education":[{"institution":"University of Alberta","location":"Edmonton, Canada","url":"https://www.ualberta.ca/en/computing-science/","area":"Computing Science","thesis":"Automated Personalized Exposure Therapy Based on Physiological Measures Using Experience-driven Procedural Content Generation via Reinforcement Learning","studyType":"Doctor of Philosophy","startDate":"2018-09-01","endDate":"2025-01-01","score":"","courses":["Intro to Virtual/Augmented Reality and Telepresence","Machine Learning and the Brain","Image Processing and Analysis in Diagnostic Imaging"]},{"institution":"Shahid Beheshti University,","location":"Tehran, Iran","url":"https://ece.ut.ac.ir/en/","area":"Computer Engineering/Artificial Intelligence","thesis":"Pattern Extraction and Analysis of the Behavior of Children with Autism Spectrum Disorders Using a Designed Video Game","studyType":"Master of Science,","startDate":"2014-09-01","endDate":"2017-08-01","score":"","courses":["Machine Learning","Neural Network","Pattern Recognition","Data Mining","Image Processing","Natural Language Processing"]},{"institution":"University of Tehran,","location":"Tehran, Iran","url":"https://encse.sbu.ac.ir/","area":"Computer Engineering/Software Engineering","thesis":"Designed and Developed a Video Game for Children with Autism to Improve their Receptive Language Skills.","studyType":"Bachelor of Science","startDate":"2009-09-01","endDate":"2014-08-01","score":"","courses":["Advanced Programming","Database Design","Data Structures","Artificial Intelligence","Operating Systems","Human-Computer Interaction","Intro to Multimedia","Intro to eLearning"]}],"skills":[{"name":"Programming Languages","level":"Master","icon":"fa-solid fa-code","keywords":["Python","MATLAB","C#","SQL"]},{"name":"Development Tools & Platforms","level":"Master","icon":"fa-solid fa-tools","keywords":["Visual Studio Code","Git","Docker","Google Cloud Platform","AWS","Linux/Bash"]},{"name":"Frameworks & Libraries","level":"Master","icon":"fa-solid fa-cubes","keywords":["PyTorch","Scikit-learn","TensorFlow","Hugging Face","Stable Baselines3","OpenAI Gym"]},{"name":"Game and Simulation Engines","level":"Advanced","icon":"fa-solid fa-gamepad","keywords":["Unity","GameMaker Studio","Virtual Reality (VR)"]}],"publications":[{"name":"The differences between children with autism and typically developed children in using a hand-eye-coordination video game","publisher":"Ubiquitous Computing and Ambient Intelligence: 11th International Conference, UCAmI","releaseDate":"2017","url":"https://link.springer.com/chapter/10.1007/978-3-319-67585-5_27","summary":"This paper introduces a touch-based hand-eye coordination video game that effectively differentiates between children with autism and typically developing children using only two in-game features, demonstrating its potential as a cost-free tool for initial screening of motor coordination issues in autism."},{"name":"A framework for easier designs: Augmented intelligence in serious games for cognitive development","publisher":"IEEE Consumer Electronics Magazine","releaseDate":"2018","url":"https://ieeexplore.ieee.org/abstract/document/8570903","summary":"This article introduces a portable, rapid development framework for intelligent serious games that leverage human intervention to minimize complex AI requirements, enabling caregivers to foster social interactions with children with special needs across various settings."},{"name":"Automated personalized exposure therapy based on physiological measures using experience-driven procedural content generation","publisher":"Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment","releaseDate":"2021","url":"https://ojs.aaai.org/index.php/AIIDE/article/view/18914","summary":"This research proposes a personalized virtual reality exposure therapy framework that utilizes physiological sensors and machine learning algorithms to automatically adapt exposure parameters through procedural content generation, addressing the limitations of subjective, hand-authored methods, with planned human studies on arachnophobia and fear of public speaking."},{"name":"Arachnophobia exposure therapy using experience-driven procedural content generation via reinforcement learning (EDPCGRL)","publisher":"Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment","releaseDate":"2021","url":"https://ojs.aaai.org/index.php/AIIDE/article/view/18904","summary":"This paper proposes a reinforcement learning-based approach that uses physiological measures to automatically adapt therapeutic content in arachnophobia exposure therapy, generating personalized virtual spiders that adapt more quickly and accurately than existing search-based methods."},{"name":"Label-Free Subjective Player Experience Modelling via Let's Play Videos","publisher":"Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment","releaseDate":"2024","url":"https://arxiv.org/abs/2410.02967","summary":"This paper introduces a label-free approach to Player Experience Modelling (PEM) using gameplay videos, validated through strong correlations with affective measures in Angry Birds gameplay."},{"name":"Stress Detection from Photoplethysmography in a Virtual Reality Environment","publisher":"ArXiv","releaseDate":"2024","url":"https://arxiv.org/abs/2409.17427","summary":"This article presents a virtual reality exposure therapy platform that non-intrusively assesses patients' mental states using photoplethysmography (PPG) signals, achieving a 70.6% accuracy in classifying relaxing and stressful states—outperforming more complex methods."},{"name":"Spiders Based on Anxiety: How Reinforcement Learning Can Deliver Desired User Experience in Virtual Reality Personalized Arachnophobia Treatment","publisher":"ACM Transactions on Interactive Intelligent Systems","releaseDate":"2026","url":"https://dl.acm.org/doi/full/10.1145/3766062","summary":"This paper introduces a framework for personalized virtual reality exposure therapy for arachnophobia that leverages procedural content generation and reinforcement learning to automatically adapt virtual spiders to elicit specific anxiety responses, demonstrating superior performance over traditional rules-based methods."}],"projects":[{"name":"Transformer-Based Glucose Level Estimation","summary":"Built end-to-end time-series pipelines using Transformer, LSTM, and autoencoder models for non-invasive glucose estimation from sensor data. [PyTorch, TensorFlow]","highlights":["Benchmarked Transformer architectures against LSTM and TCN baselines","Implemented representation learning with autoencoder-style pretraining"],"url":""},{"name":"RLHF-Inspired Personalized Reward Learning","summary":"Proposed an approach inspired by RLHF that learns reward models from physiological feedback and user embeddings for faster agent personalization. [PyTorch]","highlights":["Designed reward models incorporating physiological signals and user-specific embeddings","Implemented pretraining and fine-tuning pipelines for rapid adaptation to individual users"],"url":""},{"name":"Domain Adaptation for Sensor Data","summary":"Developed domain adaptation and generalization techniques to handle sensor variability across users, body locations, and sensor units. [PyTorch, Pandas]","highlights":["Addressed domain shift where sensors behave differently per person and placement","Implemented transfer learning strategies across sensor configurations"],"url":""},{"name":"Online Decision Transformer","summary":"Adapted and integrated an Online Decision Transformer into RL frameworks for real-time sequential decision-making. [PyTorch, Hugging Face]","highlights":["Extended offline Decision Transformer for online learning scenarios","Applied to network load balancing and energy efficiency optimization"],"url":""},{"name":"VQ-VAE for Time-Series Representation Learning","summary":"Implemented Vector-Quantized Variational Autoencoder for clustering and representation learning on high-dimensional time-series data. [PyTorch]","highlights":["Designed discrete latent representations for improved clustering","Applied to network traffic patterns for efficient data compression"],"url":""},{"name":"Explainability and Error Analysis Framework","summary":"Built workflows for model interpretability including slice-based analysis, failure mode detection, and uncertainty quantification. [PyTorch, SHAP]","highlights":["Implemented systematic error analysis to identify prediction failure patterns","Designed calibration checks to assess model confidence reliability"],"url":""},{"name":"Experience-Driven PCG via Reinforcement Learning","summary":"Developed RL-based procedural content generation that adapts virtual environments based on real-time physiological feedback. [PyTorch, OpenAI Gym, Stable Baselines3]","highlights":["Trained DQN and PPO agents to generate personalized therapeutic content","Integrated physiological sensors for closed-loop adaptation"],"url":"https://github.com/athar70/EDPCGRL4Spider"},{"name":"Curriculum Learning for RL","summary":"Implemented curriculum learning strategies to improve RL training robustness and generalization to harder scenarios. [PyTorch, Stable Baselines3]","highlights":["Designed progressive task difficulty scheduling for stable learning","Improved agent generalization through structured training curricula"],"url":""},{"name":"Stress Detection from Physiological Signals","summary":"Built classification models to detect stress states from PPG and physiological responses using ML and deep learning. [PyTorch, Scikit-learn]","highlights":["Compared traditional ML methods with LSTM-based approaches","Achieved 70.6% accuracy in VR-based stress classification"],"url":"https://github.com/athar70/Stress-Estimation"},{"name":"Heart Rate Estimation from Video","summary":"Developed CNN-based remote photoplethysmography (rPPG) for non-contact heart rate estimation from facial video. [PyTorch]","highlights":["Implemented end-to-end deep learning pipeline for video-based vital signs","Enabled non-intrusive physiological monitoring without wearables"],"url":"https://github.com/athar70/Heart-Rate-Estimation"},{"name":"Player Experience Modeling","summary":"Built data-driven models to predict player affect from gameplay videos for adaptive game content generation. [PyTorch]","highlights":["Developed label-free approach using Let's Play videos","Validated through human studies correlating predictions with affective measures"],"url":""},{"name":"Adaptive VR Environment","summary":"Created VR environments with real-time parameter adaptation based on user interactions and physiological responses. [Unity, C#]","highlights":["Integrated physiological sensors for closed-loop environment control","Applied to exposure therapy for anxiety disorders"],"url":"https://www.youtube.com/watch?v=cYK5I_U6mK0"},{"name":"Behavior Pattern Analysis","summary":"Applied ML techniques to identify and classify user behavior patterns in interactive game environments. [MATLAB]","highlights":["Extracted features to differentiate behavioral patterns","Applied to autism research for early screening applications"],"url":""},{"name":"Hidden Semi-Markov Model for Mobility Tracking","summary":"Implemented probabilistic models to track mobility patterns with missing data and multiple observation sequences. [Java]","highlights":["Handled incomplete and noisy sequential data","Improved tracking accuracy through advanced statistical modeling"],"url":""},{"name":"Serious Games for Cognitive Development","summary":"Developed educational and therapeutic video games targeting cognitive assessment and social skill development. [Unity, GameMaker]","highlights":["Designed game mechanics for children with autism spectrum disorders","Created engaging experiences for cognitive science research"],"url":""}],"volunteer":[{"organization":"Transactions on Affective Computing journal","position":"Reviewer","url":"https://dl.acm.org/journal/itac","year":"2025","summary":"Served as a reviewer for ransactions on Affective Computing journal, providing peer reviews for submissions in human-computer interaction and related fields.","highlights":[]},{"organization":"CHI Conference 2024","position":"Reviewer","url":"https://chi2024.acm.org/","year":"2024","summary":"Served as a reviewer for CHI Conference 2024, providing peer reviews for submissions in human-computer interaction and related fields.","highlights":[]},{"organization":"Experimental AI in Games (EXAG)","position":"Program Committee Member","url":"https://www.exag.org/","year":"2024","summary":"Active committee member served as a reviewer for EXAG workshops focused on experimental AI in games.","highlights":[]},{"organization":"AIIDE Conference 2025","position":"Program Committee Member","url":"https://sites.google.com/ualberta.ca/aiide2025/home","year":"2025","summary":"Provided peer reviews for research submissions focused on Artificial Intelligence and Interactive Digital Entertainment.","highlights":[]},{"organization":"PeerJ Journal","position":"Reviewer","url":"https://peerj.com/","year":"2025","summary":"Reviewed academic articles submitted to the PeerJ journal, ensuring the quality and validity of research in AI and related fields.","highlights":[]},{"organization":"Computer Science Graduate Student Association (CSGSA)","location":"Edmonton, Canada","position":"Treasurer","url":"https://sites.google.com/ualberta.ca/csgsa","year":"2019","summary":"Managed the financial operations of the CSGSA, a voluntary group offering support and activities for Computing Science graduate students at the University of Alberta.","highlights":[]}],"awards":[{"title":"Olympiad Competition Award","date":"2008","awarder":"Math and Literature Olympiads for Pre-University Students","url":"","summary":"Awarded in the Math and Literature Olympiads for pre-university students."},{"title":"Ranked 459th in the Undergraduate Nationwide Universities Entrance Exam","date":"2009","awarder":"Nationwide Universities Entrance Exam, Iran","url":"","summary":"Achieved a ranking of 459th in the Undergraduate Nationwide Universities Entrance Exam in Iran, competing against over 300,000 participants."},{"title":"Ranked 65th in the Graduate Nationwide Universities Entrance Exam","date":"2014","awarder":"Graduate Nationwide Universities Entrance Exam, Iran","url":"","summary":"Achieved a ranking of 65th in the Graduate Nationwide Universities Entrance Exam in Iran, out of more than 30,000 participants."}],"references":[{"name":"Dr. Matthew Guzdial","icon":"fa-solid fa-thumbtack","reference":"Assistant Professor in Computing Science at the University of Alberta, specializing in creative artificial intelligence and machine learning.","url":"https://www.cs.ualberta.ca/~guzdial/"},{"name":"Professor Pierre Boulanger","icon":"fa-solid fa-thumbtack","reference":"Director of the Advanced Human-Computer Interfaces Laboratory at the University of Alberta, with over 40 years of expertise in 3D computer vision and virtual reality systems.","url":"https://webdocs.cs.ualberta.ca/~pierreb/"},{"name":"Dr. Di Wu","icon":"fa-solid fa-thumbtack","reference":"Senior Staff Research Scientist at Samsung AI Center Montreal and Adjunct Professor at McGill University, focusing on reinforcement learning and AI for telecommunications.","url":"https://sites.google.com/view/di-wu/home?authuser=0&pli=1"},{"name":"Dr. Hadi Moradi","icon":"fa-solid fa-thumbtack","reference":"Assistant Professor at the University of Tehran's Electrical and Computer Engineering School, specializing in climbing robots and intelligent systems.","url":"https://ece.ut.ac.ir/en/~moradih"}]}